server/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://www.example.com/pokemons">
    <soapenv:Header />
    <soapenv:Body>
        <gs:getPokemonRequest>
            <gs:id>25</gs:id>
        </gs:getPokemonRequest>
    </soapenv:Body>
</soapenv:Envelope>